Tekla Open API Reference for Tekla Structures 2025
Weld.Direction Property
 Defines the Weld edge search direction normalized to length 1000.0. Overrides Position if set.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Vector Direction { get; set; }
Public Property Direction As Vector
	Get
	Set
Property Value
Type: Vector
See Also
Reference
Weld Class
Tekla.Structures.Model Namespace